USE MASTER

CREATE DATABASE ToursCities_945  --Имя БД
ON							     --описание файла БД
(NAME = ToursCities_dat,		 --логическое имя файла БД
	FILENAME = 'D:\Base\ToursCities.mdf',  --физическое имя файла БД
	SIZE = 5, --первоначальный размер в МБ
	MAXSIZE = 15, --максимальный размер в МБ
	FILEGROWTH = 2)  --шаг для автоматического увеличения файла в МБ
LOG ON   --описание файла БД
( NAME = ToursCities_Log,   --логическое имя журнала транзакций
	FILENAME = 'D:\Base\ToursCities.log',  --физическое имя файла БД
	SIZE = 5,  --первоначальный размер в МБ
	MAXSIZE = 15,   --максимальный размер в МБ
FILEGROWTH = 2);  --шаг для автоматического увеличения файла в МБ
GO
USE ToursCities_945
GO

CREATE TABLE Мероприятие 
	([ID мероприятия]  int NOT NULL identity(1,1),
	Исполнитель char(30) NOT NULL,
	Город char(30) NOT NULL check(Город like '%[А-Я]%'),
	Площадка char(30) NOT NULL,
	[Дата мероприятия] datetime NOT NULL,
	[Стоимость билета] money NOT NULL check([Стоимость билета]>50),
	UNIQUE(Исполнитель, [Дата мероприятия]))
GO

CREATE TABLE Поездка 
	(Мероприятие int NOT NULL,
	[Д.В. отъезда] datetime NOT NULL,
	[Место отъезда] char(60) NOT NULL,
	[Д.В. приезда] datetime NOT NULL,
	[Место приезда] char(60) NOT NULL,
	[Рег. знак автобуса] char(9) NOT NULL check ([Рег. знак автобуса] like '[АВЕКМНОРСТУХ][0-9][0-9][0-9][АВЕКМНОРСТУХ][АВЕКМНОРСТУХ][0-9][0-9]'),
	[Стоимость поездки] money NOT NULL check([Стоимость поездки]>50),
	[Вместимость автобуса] int NOT NULL check([Вместимость автобуса]>0)  default 30,
	[ID поездка] int NOT NULL identity(1,1),
	UNIQUE([Рег. знак автобуса], [Д.В. отъезда]),
	constraint CH_ДВотъезда_ДВприезда check ([Д.В. приезда]>=[Д.В. отъезда]))
GO

CREATE TABLE Бронь
	(Поездка int NOT NULL,
	Участник int NOT NULL,
	[Кол-во мест] int NOT NULL check ([Кол-во мест] > 0),
	[Необходимость покупки билета] bit NOT NULL default 1 )
GO

CREATE TABLE Участники 
	([ID участника] int NOT NULL identity(1,1),
	ФИО char(60) NOT NULL check(ФИО like '%[А-Я]%'),
	Телефон char(17) NULL check (Телефон like '+7([0-9][0-9][0-9])[0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]'))
GO

ALTER TABLE Мероприятие
	ADD CONSTRAINT PK_Мероприятие primary key([ID мероприятия])
GO

ALTER TABLE Поездка
	ADD CONSTRAINT PK_Поездка primary key([ID поездка])
GO

ALTER TABLE Бронь
	ADD CONSTRAINT PK_Бронь primary key(Поездка,Участник)
GO

ALTER TABLE Участники 
	ADD CONSTRAINT PK_Участники primary key([ID участника])
GO

ALTER TABLE Поездка 
	ADD CONSTRAINT FK_Поездка_Мероприятие FOREIGN KEY (Мероприятие)
	REFERENCES Мероприятие([ID мероприятия])
	ON DELETE CASCADE 
GO

ALTER TABLE Бронь 
	ADD CONSTRAINT FK_Бронь_Поездка FOREIGN KEY (Поездка)
	REFERENCES Поездка([ID поездка])
	ON DELETE CASCADE 
GO

ALTER TABLE Бронь
	ADD CONSTRAINT FK_Бронь_Участники FOREIGN KEY (Участник)
	REFERENCES Участники([ID участника])
	ON DELETE CASCADE 
GO

INSERT INTO Участники VALUES
	('Тихонов Алексей Владимирович','+7(910)635-02-04'),
	('Лапаева Розалия Василиевна','+7(910)434-35-19'), 
	('Чемоданова Доминика Петровна',null),
	('Хрущёва Марина Борисовна','+7(910)729-79-69'), 
	('Перминов Марк Савелиевич','+7(920)825-19-74'), 
	('Емельянов Андрей Эрнестович',	'+7(915)200-78-37'),
	('Шишов Эмиль Филиппович','+7(906)352-63-76'), 
	('Кабанов Макар Саввевич',null),
	('Курбанова Марина Олеговна','+7(916)389-31-08'), 
	('Зуева Зоя Вячеславовна','+7(915)753-09-95')
GO

INSERT INTO Мероприятие VALUES
	('Animal ДжаZ', 'Воронеж', 'Arena Hall', '2021-03-31T20:00:00.000', 1300),
	('Animal ДжаZ', 'Санкт-Петербург', 'Krop Arena', '2021-04-14T20:00:00.000', 1200),
	('Руки Вверх', 'Москва', 'Лужники', '2021-07-24T19:00:00.000',800),
	('Ария', 'Москва', 'ВТБ Арена', '2021-05-21T19:00:00.000', 1000),
	('Звери', 'Москва', '1930 Moscow', '2020-12-12T20:00:00.000', 3300),
	('Баста', 'Москва', 'Лужники', '2021-07-03T19:00:00.000', 500),
	('GREEN DAY', 'Москва', 'Стадион "Открытие Арена"', '2021-05-28T19:00:00.000', 3000),
	('Кино', 'Москва', 'ВТБ Арена', '2021-05-15T20:30:00.000', 4000),
	('БИ-2', 'Москва', 'ВТБ Арена', '2021-06-19T19:30:00.000', 2100),
	('БИ-2', 'Москва', 'Crocus City Hall', '2021-12-15T20:30:00.000', 3500),
	('Сплин', 'Москва', 'Adrenaline Stadium', '2020-12-27T20:00:00.000', 3500),
	('Noize', 'Ворнеж', 'Event-Hall', '2021-10-01T19:00:00.000', 700),
	('Noize', 'Москва', 'ВТБ Арена', '2021-11-27T19:00:00.000', 800),
	('Макс Корж', 'Санкт-Петербург', 'Гаспром Арена', '2021-07-04T19:00:00.000', 1100)
GO

INSERT INTO Поездка VALUES
	(1, '2021-03-31T10:00:00.000', 'Московское ш.,31, Рязань', '2021-03-31T16:00:00.000', 'Московский проспект, 9, Воронеж', 'Е584НР62', 1000, 40),
	(1, '2021-03-31T11:00:00.000', 'Московское ш.,31, Рязань', '2021-03-31T17:00:00.000', 'Московский проспект, 9, Воронеж', 'С454НР62', 1000, 30),
	(2,	'2021-04-13T21:00:00.000', 'Московское ш.,31, Рязань', '2021-04-14T10:00:00.000', 'Сенная площадь, 2, Санкт-Петербург', 'Е584НР62',	2500, 40),
	(3,	'2021-07-24T12:00:00.000', 'Окский пр., 35, Рязань', '2021-07-24T16:00:00.000',	'Лужники, 24, Москва', 'О112ОО62', 900,	40),
	(3,	'2021-07-24T10:00:00.000', 'Окский пр., 35, Рязань', '2021-07-24T14:00:00.000',	'Лужники, 24, Москва', 'С454НР62', 900,	40),
	(4,	'2021-05-21T12:00:00.000', 'Московское ш.,31, Рязань', '2021-05-21T16:30:00.000', 'Ленинградский просп., 36, Москва', 'О112ОО62', 1000,	36),
	(4,	'2021-05-21T12:00:00.000', 'Московское ш.,31, Рязань', '2021-05-21T17:30:00.000', 'Ленинградский просп., 36, Москва', 'Е584НР62', 1000,	40),
	(5,	'2020-12-12T09:00:00.000', 'Окский пр., 35, Рязань', '2020-12-12T13:00:00.000',	'Партийный пер.,1, Москва', 'Е584НР62',	1200, 40),
	(5,	'2020-12-12T12:00:00.000', 'Московское ш.,31, Рязань', '2020-12-12T17:00:00.000', 'Партийный пер.,1, Москва', 'С454НР62', 1200, 30),
	(6,	'2021-07-03T10:00:00.000', 'Московское ш.,31, Рязань', '2021-07-03T16:00:00.000', 'Лужники, 24, Москва', 'С454НР62', 1100, 40),
	(6,	'2021-07-03T10:00:00.000', 'Московское ш.,31, Рязань', '2021-07-03T16:30:00.000', 'Лужники, 24, Москва', 'О777ОО62', 1150, 50),
	(7,	'2021-05-28T12:00:00.000', 'Площадь победы, Рязань', '2021-05-28T18:00:00.000',	'Волоколамское ш.,69, Москва', 'О777ОО62', 900,	50),
	(7,	'2021-05-28T12:00:00.000', 'Московское ш.,31, Рязань', '2021-05-28T17:30:00.000', 'Волоколамское ш.,69, Москва', 'Е584НР62', 900, 40),
	(7,	'2021-05-28T10:00:00.000', 'Московское ш.,31, Рязань', '2021-05-28T17:40:00.000', 'Волоколамское ш.,69, Москва', 'С454НР62', 900, 30),
	(8,	'2021-05-15T12:00:00.000', 'Московское ш.,31, Рязань', '2021-05-15T18:30:00.000', 'Ленинградский просп., 36, Москва', 'О112ОО62', 1300,	36),
	(9,	'2021-06-19T11:30:00.000', 'Окский пр., 35, Рязань', '2021-06-19T18:30:00.000',	'Ленинградский просп., 36, Москва', 'О112ОО62',	1300, 36),
	(10, '2021-12-15T10:30:00.000',	'Московское ш.,31, Рязань', '2021-12-15T16:30:00.000', 'Международная ул.,20, Москва', 'О777ОО62', 1300, 50),
	(11, '2020-12-27T12:00:00.000', 'Московское ш.,31, Рязань', '2020-12-27T18:00:00.000', 'Ленинградский просп., 80, Москва', 'О777ОО62', 1000, 50),
	(12, '2021-10-01T10:00:00.000',	'Площадь победы, Рязань', '2021-10-01T16:00:00.000', 'Парковая ул., 3, Воронеж', 'Е584НР62', 1000, 40),
	(12, '2021-10-01T11:00:00.000',	'Площадь победы, Рязань','2021-10-01T17:30:00.000',	'Парковая ул., 3, Воронеж', 'О777ОО62',	1100, 50)
GO

INSERT INTO Бронь VALUES
	(1,	1,	15,	'False'),
	(1,	2,	5,	'True'),
	(3,	4,	7,	'False'),
	(4,	2,	10,	'False'),
	(4,	6,	5,	'False'),
	(5,	10,	25,	'True'),
	(7,	3,	15,	'True'),
	(8,	4,	20,	'False'),
	(8,	7,	10,	'True'),
	(9,	3,	27,	'True')
